# Указываем базовый образ с установленным Go
FROM golang:latest

# Переменная окружения для установки рабочей директории
ENV APP_HOME=/app

# Создаем рабочую директорию в контейнере
WORKDIR $APP_HOME

# Копируем go.mod и go.sum, чтобы установить зависимости
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod download

# Копируем остальные файлы проекта в рабочую директорию
COPY . .

# Компилируем приложение
RUN go build -o main ./cmd/main.go

# Указываем порт, который будет слушать приложение
EXPOSE 8080

# Команда для запуска приложения
CMD ["./main"]
